Revit 2024 API
ElementLogicalFilter Methods
The ElementLogicalFilter type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFilters
 Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
SetFilters
 Replaces current filters in the logical filter with any number of input filters.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace